# "Алфавит
# Вывести в консоль все буквы от A до Z с помощью цикла.
# Использовать тип данных char."


for i in range(65,91):
    print(chr(i))