# "Простое Приложение Здравствуй Мир
# Создать проект на Python. Реализовать
# функциональность Hello, World, печатающую строку 100 раз."

for i in range(0,100,1):
    print("Hello Word", i+1)